SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( KVB-407
	Type ( Engine )
	WagonShape ( KVB-407.s )
	Thumbnail ( Cab7000a.ace )
 	Size ( 2.05m 3.30m 7.70m )
	CentreOfGravity ( 0m 1.7m 0m )
	Mass ( 9.2t )
	WheelRadius ( 0.35m )
	InertiaTensor ( Box (1.09m 1.61m 4.11m) )
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 5E6N/m 0N/m )
			Damping ( 1E6N/m/s 0N/m/s )
			Break ( 2E7N 0N )
			r0 ( 15cm 1E9m )
		)
		CouplingHasRigidConnection (  )
		Velocity ( 0.1m/s )
	)
	
	Buffers (
		Spring (
			Stiffness ( 1E7N/m 0N/m )
			Damping ( 1E6N/m/s 0N/m/s )
			r0 ( 0m 1E9m )
		)
		Centre ( 0.5m )
		Radius ( 1m )
		Angle ( 0.5deg )
	)

	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 230kN )
	DerailBufferForce ( 200kN )
	NumWheels (	2 )
	Friction (
		150N/m/s		1		-1mph		0		1
		5.1N/rad/s		1		-1rad/s		0		1
	)
	Inside (
		PassengerCabinFile ( KVB-407.s )
		PassengerCabinHeadPos ( 0.0 2.15 0.0 )
		RotationLimit ( 180 180 180 )
		StartDirection ( 0 180 0 )
	    Sound ( "KVB-407_Pas.sms" )
	)
	
	BrakeEquipmentType ( "ep_brake" )
	BrakeSystemType( "EP" )
	MaxBrakeForce( 0kN )
	EmergencyBrakeResMaxPressure( 90 )
	TripleValveRatio( 1 )
	MaxReleaseRate( 20 )
	MaxApplicationRate( 15 )
	MaxAuxilaryChargingRate( 1 )
	EmergencyResCapacity( 1 )
	EmergencyResChargingRate( 1 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 50 )

    Sound (	"KVB-407_Eng.sms" )
    PassengerCapacity ( 30 )
	Lights ( 10
		Light (
			comment ( Lichtkegel #1 )
			Type ( 1 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFEBA4 )
					Position ( 0 3 10 )
					Azimuth ( 0 0 0 )
					Angle ( 20 )
					Transition ( 0 )
					Radius ( 75 )
				)
			)
		)
		Light (
			comment ( Lichtkegel #2 )
			Type ( 1 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State (
					Duration ( 0 )
					LightColour ( FFFFFFFF )
					Position ( 0 3.5 -1 )
					Angle ( 15 )
					Transition ( 0 )
					Radius ( 250 )
				)
			)
		)					
		Light (
			comment( Vorne mitte dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
			)
			FadeIn	( 0.3 )
			FadeOut	( 0.7 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFEBA4 )
					Position ( 0.0 0.8 4.19 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)			
		Light (
			comment( Vorne mitte bright )
			Type( 0 )
			Conditions(
				Headlight ( 3 )
				Unit ( 2 )
			)
			FadeIn	( 0.3 )
			FadeOut	( 0.7 )
			Cycle ( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.0 0.8 4.19 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)		
		Light (
			comment( Hinten links dim+bright )
			Type ( 0 )
			Conditions (
				Headlight ( 4 )
				Unit ( 3 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State	(
					Duration ( 0 )
					LightColour ( ffff0000 )
					Position ( -0.73 0.73 -3.75 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)
		Light (
			comment( Hinten rechts dim+bright )
			Type ( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle ( 0 )
			States	( 1
				State (
					Duration ( 0 )
					LightColour ( ffff0000 )
					Position ( 0.73 0.73 -3.75 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)
		
		comment ( ######## Fuehrerstandswechsel ######## )
		
		Light (
			comment( Vorne mitte dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 5 )
			)
			FadeIn	( 0.3 )
			FadeOut	( 0.7 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( FFFFEBA4 )
					Position ( 0.0 0.8 -4.25 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.75 )
				)
			)
		)			
		Light (
			comment( Vorne mitte bright )
			Type( 0 )
			Conditions(
				Headlight ( 3 )
				Unit ( 5 )
			)
			FadeIn	( 0.3 )
			FadeOut	( 0.7 )
			Cycle	( 0 )
			States	( 1
				State (
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.0 0.8 -4.25 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.75 )
				)
			)
		)
		
		Light (
			comment( Hinten rechts dim+bright)
			Type ( 0 )
			Conditions (
				Headlight ( 4 )
				Unit ( 4 )
			)
			FadeIn ( 0.5 )
			FadeOut ( 0.5 )
			Cycle ( 0 )
			States ( 1
				State	(
					Duration ( 0 )
					LightColour ( ffff0000 )
					Position ( -0.73 0.73 3.7 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)
		Light (
			comment( Hinten links dim+bright )
			Type ( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle ( 0 )
			States	( 1
				State (
					Duration ( 0 )
					LightColour ( ffff0000 )
					Position ( 0.73 0.73 3.7 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.5 )
				)
			)
		)
	)
)

Engine ( KVB-407		
	Wagon ( KVB-407 )
	Type ( Electric )
	MaxPower ( 57.8kW )
	MaxForce ( 12kN )
	MaxContinuousForce ( 10kN )
	MaxVelocity ( 30km/h )
	MaxCurrent ( 200A )
	WheelRadius ( 0.35m )
	Sanding ( 10km/h )
	NumWheels ( 2 )

	CabView ( KVB-407-Cab.cvf )

	AirBrakesAirCompressorPowerRating ( 4 )
	AirBrakesAirCompressorWattage ( 10000 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure ( 0.5 )
	AirBrakesCompressorRestartPressure ( 95 )
	AirBrakesHasLowPressureTest ( 1 )
	AirBrakesIsCompressorElectricOrMechanical ( 1 )
	AirBrakesMainMaxAirPressure ( 100 )
	AirBrakesMainMinResAirPressure ( 30 )
	AirBrakesMainResVolume ( 1 )
	EngineBrakesControllerMinPressureReduction( 6 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesControllerMaxApplicationRate ( 20 )
	EngineBrakesControllerMaxReleaseRate ( 15 )
	EngineBrakesControllerEmergencyApplicationRate ( 50 )
	EngineBrakesControllerMinSystemPressure ( 0 )
	EngineBrakesControllerMaxSystemPressure ( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty ( 60 )
	EngineBrakesControllerFullServicePressureDrop ( 28 )
	TrainBrakesControllerMaxApplicationRate ( 10 )
	TrainBrakesControllerMaxReleaseRate ( 20 )
	TrainBrakesControllerEmergencyApplicationRate ( 10 )
	TrainBrakesControllerMinSystemPressure ( 0 )
	TrainBrakesControllerMaxSystemPressure ( 90 )
	TrainBrakesControllerEmergencyBrakeTimePenalty ( 10 )
	TrainBrakesControllerFullServicePressureDrop ( 28 )
	EngineBrakesProportionalBrakeLag ( 0.9 )
	EngineBrakesControllerDirectControlExponent( 1 )

	DynamicBrakesMinUsableSpeed ( -87 )
	DynamicBrakesMaximumEffectiveSpeed ( -37 )
	DynamicBrakesMaximumForce ( 20kN )
	DynamicBrakesResistorCurrentLimit ( 500 )
	DynamicBrakesCutInSpeed ( -86 )
	DynamicBrakesFadingSpeed ( 37 )
	DynamicBrakesDelayTimeBeforeEngaging ( 0 )
	DynamicBrakesMaximumSpeedForFadeOut ( 87 )
	DynamicBrakesEffectAtMaximumFadeOut ( 0 )
	DynamicBrakesHigherSpeedCurveExponent ( 1 )
	DynamicBrakesLowerSpeedCurveExponent ( 1 )
	DynamicBrakesNumberOfControllerNotches ( 2 )
	DynamicBrakeHasAutoBailOff ( 1 )
	BrakesTrainBrakeType ( EP )
	BrakesEngineControllers ( "Independent, Train,Dynamic" )
	BrakesEngineBrakeType( "Air_single_pipe"  )
        
 	Sound (	"KVB-407_Cab.sms" )
 	Name ( "KVB Wagen 407" )

	Description (
		"Dieses Modell stellt Kölns erste elektrische Straßenbahn , den TW 407 dar."+
		"by Christian Reichelt"
	) 	
	
	EngineOperatingProcedures (
		"So setzen Sie den Zug in Bewegung\n"+
		"1. 	Der Stromabnehmer wurde bereits ausgefahren. (Sollte dies aus irgendeinem Grund noch nicht geschehen sein, drücken Sie die P-TASTE, um den Stromabnehmer auszufahren.)\n"+	
		"2.	Drücken Sie die D-TASTE, um den Hauptsteuerhebel in die Position Leerlauf zu stellen.\n"+
		"	Hinweis: Wenn sich der Hauptsteuerhebel in der Stellung Leerlauf befindet, leuchtet eine grünes Licht auf.\n"+
		"3.	Drücken Sie die W-TASTE, um den Richtungshebel auf  Vorwärts zu stellen.\n"+
		"	Hinweis: Der Richtungshebel kann nur bedient werden, wenn sich der Regler in der Stellung Leerlauf befindet.\n"+
		"4.	Drücken Sie die D-TASTE, um den Hauptsteuerhebel in die Reglerkerbe 1 zu stellen.\n"+
		"5.	Wenn Sie schneller fahren möchten, drücken Sie die D-TASTE, um den Hauptsteuerhebel in eine höhere Reglerkerbe zu bewegen.\n"+
		"So bremsen Sie den Zug ab\n"+
		"1.	Drücken Sie die A-TASTE, um den Regler nach unten zu bewegen.\n"+
		"2.	Setzen Sie die Bremsen ein, wenn Sie noch weiter abbremsen möchten.\n\n"+   
		"So bedienen Sie die Zugbremsen\n"+
		"1.	Drücken Sie die Ä-TASTE, um die Zugbremse zu ziehen.\n\n"+
		"So lösen Sie die Zugbremsen\n"+
		"1. Drücken Sie die Ö-TASTE, um die Zugbremsen zu lösen.\n\n"+
		"So lösen Sie die Notbremse aus\n"+
		"1.	Drücken Sie die A-TASTE, um den Hauptsteuerhebel zur höchsten Bremseinstellung zu bewegen.\n"+
		"	- oder -\n"+
		"2.	Drücken Sie die RÜCKTASTE.\n\n"+
		"So fahren Sie rückwärts\n"+
		"1.	Halten Sie den Zug vollständig an.\n"+ 
		"2.	Drücken Sie die S-TASTE, um den Richtungshebel in die Position Rückwärts zu stellen.\n"+
		"	Hinweis: Der Richtungshebel kann nur bedient werden, wenn sich der Regler in der Stellung Leerlauf befindet.\n"+
		"4.	Drücken Sie die Ö-TASTE, um die Bremsen zu lösen.\n"+
		"5.	Schieben Sie den Regler langsam nach vorne (D-TASTE).\n\n"+
		"So lassen Sie Fahrgäste ein- und aussteigen\n"+
		"1. Halten Sie an einem Bahnhof an.\n"+
		"2. Drücken Sie die EINGABETASTE.\n"+
		"3. Warten Sie auf das 'Signal zur Abfahrt'.\n"+
		"TIPP: Verwenden Sie die Lokführerinformation 'Nächster Halt' (F10), um das Ein- und Aussteigen zu überwachen."
	)

   	EmergencyStopMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 0 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 1 )
		MonitoringDeviceAppliesShutsDownEngine ( 1 )
		MonitoringDeviceResetOnResetButton ( 1 )
		MonitoringDeviceResetOnZeroSpeed ( 1 )		
    )
	
	AWSMonitor(
		MonitoringDeviceMonitorTimeLimit( -1 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
	)
		
	EngineControllers (
		AWS ( 0 1 0 )
		BailOffButton ( 0 1 0 )
		BellToggle ( 0 1 0 )
		Brake_Dynamic ( 0 1 0.2 0
			NumNotches ( 6
				Notch ( 0 0 Dummy )
				Notch ( 0.2 0 Dummy )
				Notch ( 0.4 0 Dummy )
				Notch ( 0.6 0 Dummy )
				Notch ( 0.8 0 Dummy )
				Notch ( 0.999999 0 Dummy )
			)
		)
		Brake_Train ( 0 1 1 0
			NumNotches ( 3
				Notch ( 0 0 TrainBrakesControllerReleaseStart )
				Notch ( 1 0 TrainBrakesControllerFullServiceStart )
				Notch ( 0 0 TrainBrakesControllerEmergencyStart )
			)
		)
		Brake_Engine ( 0 1 0.05 0
			NumNotches ( 0 )
		)
		Throttle ( 0 1 0.166666666666667 0
			NumNotches ( 7
				Notch ( 0 0 Dummy )
				Notch ( 0.2 0 Dummy )
				Notch ( 0.3 0 Dummy )
				Notch ( 0.4 0 Dummy )
				Notch ( 0.7 0 Dummy )
				Notch ( 0.9 0 Dummy )
				Notch ( 0.999999 0 Dummy )
			)
		)
		Combined_Control ( 0 1 0.5 0.5 throttle dynamic )
		DirControl ( -1 0 1 1 )
		EmergencyStopToggle ( 0 1 0 )
		Headlights ( 0 0.25 1 0 )
		PantographToggle1 ( 0 1 1 )
		Sanding ( 0 1 0 )
		Vigilance ( 0 1 0 )
	)
)
